In [9]:
#Import the necessary account
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [143]:
#Read in the data
netflix=pd.read_csv(r'C:\Users\IBK PC\Desktop\DATA SCIENCE PROJECTS\NETFLIX\netflix_titles.csv',parse_dates=['date_added'],usecols=['date_added','release_year']) #parses date help tell Python that the colum should be shown explicitly as date in number
owid=pd.read_excel(r'C:\Users\IBK PC\Desktop\DATA SCIENCE PROJECTS\OWID-COVID-DATA\owid-covid-data-update-to-2021-JAN-16.xlsx',sheet_name=0,usecols=['date'])
medium=pd.read_csv(r'C:\Users\IBK PC\Desktop\DATA SCIENCE PROJECTS\MEDIUM_DATA\medium_data.csv',usecols=['date'])
fs=pd.read_clipboard()

In [10]:
#Read in another data
netflix_2=pd.read_csv(r'C:\Users\IBK PC\Desktop\DATA SCIENCE PROJECTS\NETFLIX\netflix_titles.csv',usecols=['date_added','release_year'])

In [11]:
netflix_2.head(3)

          date_added  release_year
0  September 9, 2019          2019
1  September 9, 2016          2016
2  September 8, 2018          2013

In [12]:
netflix_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date_added    6223 non-null   object
 1   release_year  6234 non-null   int64
dtypes: int64(1), object(1)
memory usage: 73.1+ KB

In [147]:
netflix.head()

  date_added  release_year
0 2019-09-09          2019
1 2016-09-09          2016
2 2018-09-08          2013
3 2018-09-08          2016
4 2017-09-08          2017

In [148]:
owid.head(3)

         date
0  2020-02-24
1  2020-02-25
2  2020-02-26

In [149]:
fs.head()

         Date  Month Number  Month Name   Year
0  01/01/2014             1     January   2014
1  01/01/2014             1     January   2014
2  01/06/2014             6        June   2014
3  01/06/2014             6        June   2014
4  01/06/2014             6        June   2014

In [150]:
medium.head()

         date
0  2019-05-30
1  2019-05-30
2  2019-05-30
3  2019-05-30
4  2019-05-30

In [151]:
#Get info about the data frames
netflix.info()
owid.info()
medium.info()
fs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date_added    6223 non-null   datetime64[ns]
 1   release_year  6234 non-null   int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 97.5 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60503 entries, 0 to 60502
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    60503 non-null  object
dtypes: object(1)
memory usage: 236.4+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6508 entries, 0 to 6507
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    6508 non-null   object
dtypes: object(1)
memory usage: 25.5+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          700 non-null    object
 1   Month Number  700 non-null    int64
 2    Month Name   700 non-null    object
 3   Year          700 non-null    int64
dtypes: int64(2), object(2)
memory usage: 16.5+ KB

In [162]:
#Ensure the date columns are in datetime format
netflix['date_added']=pd.to_datetime(netflix['date_added'])
owid['date']=pd.to_datetime(owid['date'])
medium['date']=medium['date'].astype('datetime64')
fs['Date']=pd.to_datetime(fs['Date'])

In [163]:
#Now check the info about the data again
netflix.info()
owid.info()
medium.info()
fs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6234 entries, 0 to 6233
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date_added    6223 non-null   datetime64[ns]
 1   release_year  6234 non-null   int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 97.5 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60503 entries, 0 to 60502
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    60503 non-null  datetime64[ns]
 1   day     60503 non-null  int64
 2   month   60503 non-null  int64
 3   year    60503 non-null  int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 1.8 MB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6508 entries, 0 to 6507
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    6508 non-null   datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 50.9 KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          700 non-null    datetime64[ns]
 1   Month Number  700 non-null    int64
 2    Month Name   700 non-null    object
 3   Year          700 non-null    int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 19.2+ KB

In [164]:
#Separate the date column into day, month, and year columns
owid['day']=owid['date'].dt.day
owid['month']=owid['date'].dt.month
owid['year']=owid['date'].dt.year

In [165]:
owid.head(3)

        date  day  month  year
0 2020-02-24   24      2  2020
1 2020-02-25   25      2  2020
2 2020-02-26   26      2  2020

In [166]:
#Separate the date column into day, month and year columns
medium['day']=medium['date'].dt.day
medium['month']=medium['date'].dt.month
medium['year']=medium['date'].dt.year

In [197]:
#We can also create the month column using the name of each month as values
medium['month_name']=medium['date'].dt.month_name()

In [198]:
medium.head(3)

        date  day  month  year month_name
0 2019-05-30   30      5  2019        May
1 2019-05-30   30      5  2019        May
2 2019-05-30   30      5  2019        May

In [169]:
#Separate the date_added column into day, month and year columns
netflix['day']=netflix['date_added'].dt.day
netflix['month']=netflix['date_added'].dt.month
netflix['year']=netflix['date_added'].dt.year

In [170]:
netflix.head()

  date_added  release_year  day  month    year
0 2019-09-09          2019  9.0    9.0  2019.0
1 2016-09-09          2016  9.0    9.0  2016.0
2 2018-09-08          2013  8.0    9.0  2018.0
3 2018-09-08          2016  8.0    9.0  2018.0
4 2017-09-08          2017  8.0    9.0  2017.0

In [188]:
#Drop the Year column since we are creting a new one
fs=fs.drop(['Year''Month Number'],axis=1)

In [189]:
#Separate the date column into day, month and year columns
fs['day']=fs['Date'].dt.day
fs['month']=fs['Date'].dt.month
fs['year']=fs['Date'].dt.year

In [190]:
fs.head()

        Date  Month Name   day  month  year
0 2014-01-01     January     1      1  2014
1 2014-01-01     January     1      1  2014
2 2014-01-06        June     6      1  2014
3 2014-01-06        June     6      1  2014
4 2014-01-06        June     6      1  2014

In [13]:
#Drop all empty rows
netflix_2=netflix_2.dropna()

In [14]:
#Extract the month from the date_added column and put in a separate column
netflix_2['month_added']=netflix_2['date_added'].apply(lambda x: x.lstrip().split(" ")[0])

In [15]:
netflix_2.head(3)

          date_added  release_year month_added
0  September 9, 2019          2019   September
1  September 9, 2016          2016   September
2  September 8, 2018          2013   September

In [17]:
netflix_2['month_added'].head()

0    September
1    September
2    September
3    September
4    September
Name: month_added, dtype: object

In [19]:
#Extract the year from the date_added column and put in a separate column
netflix_2['year_added']=netflix_2['date_added'].apply(lambda x: x.lstrip().split(" ")[-1])

In [21]:
netflix_2['year_added'].head()

0    2019
1    2016
2    2018
3    2018
4    2017
Name: year_added, dtype: object